class Balance:
	"""Баланс профиля."""
	
	#==========================================================================================#
	# >>>>> СВОЙСТВА ТОЛЬКО ДЛЯ ЧТЕНИЯ <<<<< #
	#==========================================================================================#

	@property
	def bonus(self) -> int:
		"""Бонус."""
		
		return self.__Bonus
	
	@property
	def real(self) -> int:
		"""Реальные средства."""

		return self.__Real
	
	#==========================================================================================#
	# >>>>> ПУБЛИЧНЫЕ МЕТОДЫ <<<<< #
	#==========================================================================================#

	def __init__(self, real: int, bonus: int):
		"""
		Баланс профиля.
			real – реальные средства;
			bonus – бонус.
		"""

		#---> Генерация динамических свойств.
		#==========================================================================================#
		# Бонус.
		self.__Bonus = bonus
		# Реальные средства.
		self.__Real = real

class ProfileInfo:
	"""Баланс профиля."""
	
	#==========================================================================================#
	# >>>>> СВОЙСТВА ТОЛЬКО ДЛЯ ЧТЕНИЯ <<<<< #
	#==========================================================================================#

	@property
	def email(self) -> str:
		"""Адрес электронной почты."""
		
		return self.__Data["email"]
	
	@property
	def id(self) -> int:
		"""Номер профиля."""

		return self.__Data["id"]
	
	@property
	def name(self) -> str:
		"""Имя профиля."""

		return self.__Data["name"]
	
	@property
	def phone(self) -> int:
		"""Номер телефона."""

		return self.__Data["phone"]
	
	@property
	def profile_url(self) -> str:
		"""Ссылка на профиль."""

		return self.__Data["profile_url"]
	
	#==========================================================================================#
	# >>>>> ПУБЛИЧНЫЕ МЕТОДЫ <<<<< #
	#==========================================================================================#

	def __init__(self, data: dict):
		"""
		Баланс профиля.
			data – словарь данных профиля.
		"""

		#---> Генерация динамических свойств.
		#==========================================================================================#
		# Данные профиля.
		self.__Data = data